app/Controllers/Post.php

SELECT *
FROM `posts`
WHERE `title` LIKE '%asd%' ESCAPE '!'
OR  `content` LIKE '%asd%' ESCAPE '!'
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `posts`
WHERE `title` LIKE '%asd%' ESCAPE '!'
OR  `content` LIKE '%asd%' ESCAPE '!'
---
    public function index()
    {

        $search   = $this->request->getGet('search');
        $postModel = new \App\Models\PostModel();

        if ($search) {
            $postModel
                ->like('title',   $search)
                ->orLike('content', $search);
        }

        $data = [
            'posts'  => $postModel->paginate(10, 'post'),
            'pager'  => $postModel->pager,
            'search' => $search,
        ];

INSERT INTO `posts` (`title`, `content`) VALUES ('asdasd', 'fgjdfkgjdlfkg')
---
            $postModel = new PostModel();

            //insert data into database
            $postModel->insert([
                'title'   => $this->request->getPost('title'),
                'content' => $this->request->getPost('content'),
            ]);

SELECT *
FROM `posts`
WHERE `posts`.`id` = '1'
---
    public function edit($id)
    {
        //model initialize
        $postModel = new PostModel();

        $data = array(
            'post' => $postModel->find($id)
        );

UPDATE `posts` SET `title` = 'Test', `content` = 'Percobaan aklsdjalksdjakls'
WHERE `posts`.`id` IN ('1')
---
                $postModel = new PostModel();

                //insert data into database
                $postModel->update($id, [
                    'title' => $this->request->getPost('title'),
                    'content' => $this->request->getPost('content'),
                ]);

SELECT *
FROM `posts`
WHERE `posts`.`id` = '2'
DELETE FROM `posts`
WHERE `id` IN ('2')
---
    public function delete($id)
    {
        //model intialize
        $postModel = new PostModel();

        $post = $postModel->find($id);

        if($post) {
            $postModel->delete($id);