app/Controllers/Post.php

    public function index()
    {

        //model initialize
        $postModel = new PostModel();


        //pager initialize
        $pager = \Config\Services::pager();

        $data = array(
            'posts' => $postModel->paginate(2, 'post'),
            'pager' => $postModel->pager
        );
---
SELECT *
FROM `posts`
 LIMIT 2, 2